oreo/cartridges/int_postnl/cartridge/webreferences2/LocationWebService.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions name="LocationWebService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:i0="http://postnl.nl/cif/services/LocationWebService/" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:import namespace="http://postnl.nl/cif/services/LocationWebService/" location="https://service.postnl.com/CIF/LocationWebService/1_1/?wsdl=LocationWebService_1.wsdl" /><wsdl:types /><wsdl:binding name="BasicHttpBinding_ILocationWebService" type="i0:ILocationWebService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http" /><wsdl:operation name="GetNearestLocations"><soap:operation soapAction="http://postnl.nl/cif/services/LocationWebService/ILocationWebService/GetNearestLocations" style="document" /><wsdl:input name="GetNearestLocationsRequestContract"><soap:body use="literal" /></wsdl:input><wsdl:output name="GetNearestLocationsResponseContract"><soap:body use="literal" /></wsdl:output><wsdl:fault name="CifExceptionFault"><soap:fault name="CifExceptionFault" use="literal" /></wsdl:fault></wsdl:operation><wsdl:operation name="GetLocationsInArea"><soap:operation soapAction="http://postnl.nl/cif/services/LocationWebService/ILocationWebService/GetLocationsInArea" style="document" /><wsdl:input name="GetLocationsInAreaRequestContract"><soap:body use="literal" /></wsdl:input><wsdl:output name="GetLocationsInAreaResponseContract"><soap:body use="literal" /></wsdl:output><wsdl:fault name="CifExceptionFault"><soap:fault name="CifExceptionFault" use="literal" /></wsdl:fault></wsdl:operation><wsdl:operation name="GetLocation"><soap:operation soapAction="http://postnl.nl/cif/services/LocationWebService/ILocationWebService/GetLocation" style="document" /><wsdl:input name="GetLocationRequestContract"><soap:body use="literal" /></wsdl:input><wsdl:output name="GetLocationResponseContract"><soap:body use="literal" /></wsdl:output><wsdl:fault name="CifExceptionFault"><soap:fault name="CifExceptionFault" use="literal" /></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="LocationWebService"><wsdl:port name="BasicHttpBinding_ILocationWebService" binding="tns:BasicHttpBinding_ILocationWebService"><soap:address location="https://service.postnl.com/CIF/LocationWebService/1_1/" /></wsdl:port></wsdl:service></wsdl:definitions>